{
  "0": {
    "quote": "\"One option is no option. Two options is a dilemma. Three options is a choice.\"",
    "attribution": "Anthony Robbins"
  },
  "1": {
    "quote": "\"And though each habit means relatively little on its own, over time, the meals we order, what we say to our kids each night, whether we save or spend, how often we exercise, and the way we organize our thoughts and work routines have enormous impacts on our health, productivity, financial security, and happiness.\"",
    "attribution": "Charles Duhigg"
  },
  "2": {
    "quote": "\"Far better is it to dare mighty things, to win glorious triumphs, even though checkered by failure… than to rank with those poor spirits who neither enjoy nor suffer much, because they live in a gray twilight that knows not victory nor defeat.\"",
    "attribution": "Theodore Roosevelt"
  },
  "3": {
    "quote": "\"Just when the caterpillar thought the world was over, it became a butterfly.\"",
    "attribution": "Proverb"
  },
  "4": {
    "quote": "\"Don’t say to yourself that you’re going to make the greatest wall ever made. Set one brick at a time as perfectly as you can. Do that every day, and soon you will have a wall.\"",
    "attribution": "Will Smith"
  },
  "5": {
    "quote": "\"We keep moving forward, opening new doors, and doing new things, because we’re curious and curiosity keeps leading us down new paths.\"",
    "attribution": "Walt Disney"
  },
  "6": {
    "quote": "\"Sometimes the questions are complicated and the answers are simple.\"",
    "attribution": "Dr Seuss"
  },
  "7": {
    "quote": "\"Everything has beauty, but not everyone sees it.\"",
    "attribution": "Confucius"
  },
  "8": {
    "quote": "\"The opposite of courage in our society is not cowardice, it is conformity.\"",
    "attribution": "Rollo May"
  },
  "9": {
    "quote": "\"Our lives begin to end the day we become silent about things that matter.\"",
    "attribution": "Martin Luther King, Jr."
  },
  "10": {
    "quote": "\"Courage is the power to let go of the familiar.\"",
    "attribution": "Raymond Lindquist"
  },
  "11": {
    "quote": "\"The cave you fear to enter holds the treasure you seek.\"",
    "attribution": "Joseph Campbell"
  },
  "12": {
    "quote": "\"Life shrinks or expands in proportion to one's courage.\"",
    "attribution": "Anais Nin"
  },
  "13": {
    "quote": "\"A friend is someone who knows all about you and loves you just the same.\"",
    "attribution": "Elbert Hubbard"
  },
  "14": {
    "quote": "\"Never let your sense of morals get in the way of doing what's right.\"",
    "attribution": "Isaac Asimov"
  },
  "15": {
    "quote": "\"Forgiveness does not change the past, but it does enlarge the future.\"",
    "attribution": "Paul Boese"
  }
}
